Revit 2027 API
FabricationPart.GetDimensionCalculatedOptions Method
 Gets the calculated options of the fabrication dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetDimensionCalculatedOptions(
	FabricationDimensionDefinition dim
)
Public Function GetDimensionCalculatedOptions (
	dim As FabricationDimensionDefinition
) As IList(Of String)
public:
IList<String^>^ GetDimensionCalculatedOptions(
	FabricationDimensionDefinition^ dim
)
member GetDimensionCalculatedOptions :
        dim : FabricationDimensionDefinition -> IList<string>
Parameters
dim FabricationDimensionDefinition
 The fabrication dimension.
Return Value
IList<String>
 The calculated options of the fabrication dimension.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace